note-java.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-26 Fri 16:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
<a href="index.html">Home</a>
</div>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga378b06">java 基础碎片</a>
<ul>
<li><a href="#orgedf56bf">base</a></li>
<li><a href="#orgc315a85">collection</a></li>
<li><a href="#org32d71e0">concurrent</a></li>
<li><a href="#org65abe8e">Q&amp;A</a></li>
</ul>
</li>
<li><a href="#org6874746">java Q&amp;A</a>
<ul>
<li><a href="#org4f37242">基础知识：</a></li>
<li><a href="#org5685bee">IO:</a></li>
<li><a href="#org5af43f3">算法：</a></li>
<li><a href="#orga72f4f0">多线程相关：</a></li>
<li><a href="#org1d417a7">数据库相关（mysql）：</a></li>
<li><a href="#orgf346a19">mq：</a></li>
<li><a href="#org93fe54e">nosql相关（主要是redis）:</a></li>
<li><a href="#org2961e7d">zookeeper:</a></li>
<li><a href="#org0e17832">linux相关：</a></li>
<li><a href="#orgebe94dc">设计与思想：</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga378b06" class="outline-2">
<h2 id="orga378b06">java 基础碎片</h2>
<div class="outline-text-2" id="text-orga378b06">
</div>
<div id="outline-container-orgedf56bf" class="outline-3">
<h3 id="orgedf56bf">base</h3>
<div class="outline-text-3" id="text-orgedf56bf">
<p>
overload  重载  类
overriding  super hidden 重写 继承
</p>
</div>
</div>
<div id="outline-container-orgc315a85" class="outline-3">
<h3 id="orgc315a85">collection</h3>
<div class="outline-text-3" id="text-orgc315a85">
</div>
<div id="outline-container-org69e014c" class="outline-4">
<h4 id="org69e014c">ArrayList</h4>
<div class="outline-text-4" id="text-org69e014c">
<p>
<a href="http://wangkuiwu.github.io/2012/02/03/collection-03-arraylist/">http://wangkuiwu.github.io/2012/02/03/collection-03-arraylist/</a>
</p>

<p>
ArrayList 是一个数组队列，相当于 动态数组 能动态增长
</p>

<p>
ArrayList 继承了AbstractList，实现了List。它是一个数组队列，提供了相关的添加、删除、修改、遍历等功能
</p>

<p>
和Vector不同，ArrayList中的操作不是线程安全的！所以，建议在单线程中才使用ArrayList
</p>
</div>
</div>
<div id="outline-container-org996373a" class="outline-4">
<h4 id="org996373a">LinkedList</h4>
<div class="outline-text-4" id="text-org996373a">
<p>
<a href="http://wangkuiwu.github.io/2012/02/05/collection-05-linkedlist/">http://wangkuiwu.github.io/2012/02/05/collection-05-linkedlist/</a>
双向链表
(01) LinkedList继承于AbstractSequentialList，并且实现了Dequeue接口。
(02) LinkedList包含两个重要的成员：header 和 size。
</p>
</div>
</div>

<div id="outline-container-orgba71221" class="outline-4">
<h4 id="orgba71221">HashMap</h4>
</div>
</div>
<div id="outline-container-org32d71e0" class="outline-3">
<h3 id="org32d71e0">concurrent</h3>
<div class="outline-text-3" id="text-org32d71e0">
<p>
<a href="http://wangkuiwu.github.io/2012/08/01/threads-index/">http://wangkuiwu.github.io/2012/08/01/threads-index/</a>
</p>
</div>
<div id="outline-container-org588a15e" class="outline-4">
<h4 id="org588a15e">基础概念</h4>
<div class="outline-text-4" id="text-org588a15e">
<ul class="org-ul">
<li>线程五种状态
<ol class="org-ol">
<li>new
新建状态
Thread thread = new Thread()</li>
<li>runnable
就绪状态
thread.start() 随时可能被CPU调度执行</li>
<li>running
运行状态
线程获取CPU权限进行执行,线程只能从runnable &#x2013;&gt; running</li>
<li>blocked 
阻塞状态
是线程放弃CPU使用权

<ul class="org-ul">
<li>阻塞分三种情况:
<ul class="org-ul">
<li>等待阻塞
调用wait()等待某工作完成</li>
<li>同步阻塞
synchroized 同步锁被其他线程占用</li>
<li>其他阻塞
sleep() or join() or 发I/O请求</li>
</ul></li>
</ul></li>
<li>dead
死亡状态
线程执行结束 or 异常退出run()方法</li>
</ol></li>
</ul>

<p>
wait()  休眠
</p>

<p>
notify() 唤醒
</p>

<p>
notifyAll()
</p>
</div>
</div>
<div id="outline-container-org905e84c" class="outline-4">
<h4 id="org905e84c">常用的实现多线程的两种方式</h4>
<div class="outline-text-4" id="text-org905e84c">
<p>
Thread 和 Runnable 的相同点：都是“多线程的实现方式”。
Thread 和 Runnable 的不同点：
Thread 是类，而Runnable是接口；Thread本身是实现了Runnable接口的类。我们知道“一个类只能有一个父类，但是却能实现多个接口”，因此Runnable具有更好的扩展性。
此外，Runnable还可以用于“资源的共享”。即，多个线程都是基于某一个Runnable对象建立的，它们会共享Runnable对象上的资源。
通常，建议通过“Runnable”实现多线程！
</p>
</div>
</div>
<div id="outline-container-orgab3538f" class="outline-4">
<h4 id="orgab3538f">等待唤醒让步</h4>
<div class="outline-text-4" id="text-orgab3538f">
<p>
watit() 运行状态-&gt;阻塞状态
sleep()
notify()
yield() 运行状态-&gt;就绪状态  不释放锁
join() 的作用：让“主线程”等待“子线程”结束之后才能继续运行
</p>
</div>
</div>
<div id="outline-container-org579b369" class="outline-4">
<h4 id="org579b369">生产消费模式</h4>
<div class="outline-text-4" id="text-org579b369">
<p>
<a href="http://wangkuiwu.github.io/2012/08/11/threads-basic/">http://wangkuiwu.github.io/2012/08/11/threads-basic/</a>
</p>
</div>
</div>
<div id="outline-container-org14f9c88" class="outline-4">
<h4 id="org14f9c88">原子类</h4>
<div class="outline-text-4" id="text-org14f9c88">
<p>
基本类型: AtomicInteger, AtomicLong, AtomicBoolean ;
数组类型: AtomicIntegerArray, AtomicLongArray, AtomicReferenceArray ;
引用类型: AtomicReference, AtomicStampedRerence, AtomicMarkableReference ;
对象的属性修改类型: AtomicIntegerFieldUpdater, AtomicLongFieldUpdater, AtomicReferenceFieldUpdater 。
这些类存在的目的是对相应的数据进行原子操作。所谓原子操作，是指操作过程不会被中断，保证数据操作是以原子方式进行的
</p>
</div>
</div>
<div id="outline-container-org7bbedf8" class="outline-4">
<h4 id="org7bbedf8">锁</h4>
<div class="outline-text-4" id="text-org7bbedf8">
<p>
根据锁的添加到Java中的时间，Java中的锁，可以分为"同步锁"和"JUC包中的锁"
</p>
<ol class="org-ol">
<li>同步锁 
获取到同步锁的线程就能进行CPU调度，从而在CPU上执行；而没有获取到同步锁的线程，必须进行等待，</li>
<li>JUC包中的锁
<ul class="org-ul">
<li>Lock</li>
<li>ReadWriteLock</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org8c16d41" class="outline-4">
<h4 id="org8c16d41">线程池</h4>
<div class="outline-text-4" id="text-org8c16d41">
<p>
Executor &#x2013;&gt; ExecutorService &#x2013;&gt; AbstractExecutorService &#x2013;&gt; ThreadPoolExecutor
</p>

<p>
Executors是个静态工厂类。它通过静态工厂方法返回ExecutorService、ScheduledExecutorService、ThreadFactory 和 Callable 等类的对象
</p>
</div>
</div>
</div>

<div id="outline-container-org65abe8e" class="outline-3">
<h3 id="org65abe8e">Q&amp;A</h3>
<div class="outline-text-3" id="text-org65abe8e">
</div>
<div id="outline-container-org9ad90cf" class="outline-4">
<h4 id="org9ad90cf">什么是序列化</h4>
</div>
<div id="outline-container-org91b9d9c" class="outline-4">
<h4 id="org91b9d9c">装饰器</h4>
<div class="outline-text-4" id="text-org91b9d9c">
<p>
java pyhon
</p>
</div>
</div>
<div id="outline-container-org28a204d" class="outline-4">
<h4 id="org28a204d">爬楼梯算法</h4>
</div>
<div id="outline-container-org4609216" class="outline-4">
<h4 id="org4609216">arraylist linkedlist currentArraylist</h4>
</div>
<div id="outline-container-org468a55f" class="outline-4">
<h4 id="org468a55f">shell</h4>
<div class="outline-text-4" id="text-org468a55f">
<p>
14.某个目录下有两个文件a.txt和b.txt,文件格式为（ip，username）,
</p>

<p>
列如：
</p>

<p>
a.txt
127.0.0.1 zhangsan
127.0.0.1 wangxiaoer
127.0.0.2 lisi
127.0.0.3 wangwu
</p>

<p>
b.txt
127.0.0.4 lixiaolu
127.0.0.1 lisi
</p>

<p>
每个文件至少100万行，请使用Linux命令完成如下工作：
</p>

<p>
1）每个文件各自的ip数
2）出现在b.txt而没有出现在a.txt的ip
3）每个user出现的次数以及每个user对应的ip数
</p>
</div>
<div id="outline-container-orgd99c3fc" class="outline-5">
<h5 id="orgd99c3fc">ps aux</h5>
</div>
<div id="outline-container-orgdafca4d" class="outline-5">
<h5 id="orgdafca4d">grep awk</h5>
<div class="outline-text-5" id="text-orgdafca4d">
<p>
grep '[0-9]\{1,3\}\.[0-9]\{1,3\}\.[0-9]\{1,3\}\.[0-9]\{1,3\}' 111.txt  IP
</p>
</div>
</div>

<div id="outline-container-orgf16d88f" class="outline-5">
<h5 id="orgf16d88f">netstat</h5>
<div class="outline-text-5" id="text-orgf16d88f">
<p>
a 所有 n 不逆向确认 t/u tcp udp 
p 端口 -c 持续监听
</p>
</div>
</div>

<div id="outline-container-orgc036b91" class="outline-5">
<h5 id="orgc036b91">tcpdump</h5>
<div class="outline-text-5" id="text-orgc036b91">
<p>
root下
-i eth0
-D 显示有多少网卡
-w 文件内
-vv 显式详细的信息
-n 不进行域名反解析 都是IP地址
-c 10 十个包
tcpdump -A 以assic码显式，数据包内容是二进制的，所以现在的会有乱码现象
tcpdump -X 以两种 16进制和 assic形式
</p>

<p>
&#x2014;
局域网 dns 等 多是使用udp协议  
</p>

<p>
协议 tcpdump tcp/icmp/udp 
     tcpdump -i eth0 'ip proto \tcp or \udp'
端口 tcpdump port 80  
     tcpdump portrange 1-1024
     tcpdump src port 80
     tcpdump host www.baidu.com/192.168.1.1
数据包大小
     tcpdump less 100
     tcpdump greater 100
服务器受到攻击,如何判断流量来自哪里?
</p>

<p>
&#x2014;
  and / or 组合
</p>

<p>
tcpdump tcp and src 192.168.67.1 and port 53867
</p>

<p>
tcpdump tcp or udp
</p>

<p>
tcpdump tcp and not port 80
</p>
</div>
</div>

<div id="outline-container-org45ba1f0" class="outline-5">
<h5 id="org45ba1f0">nc  scp  rsync</h5>
</div>
<div id="outline-container-org28a9ec4" class="outline-5">
<h5 id="org28a9ec4">iptables</h5>
<div class="outline-text-5" id="text-org28a9ec4">
<p>
linux 内核 通过netfilter模块 实现网络访问控制功能
iptables &#x2013;&gt; netfilter模块
对流量 允许 丢弃 修改等操作
</p>

<p>
src dst 接口  tcp udp 端口号 连接状态(new,ESTABLISHED)
</p>

<p>
chain  过滤点: input forward output prerouting postrouting
table :  filter nat mangle
</p>

<p>
filter(chain) 对数据进行过滤
nat 用以对数据包的源、目标地址进行修改
mangle 用以对数据包的高级修改
</p>
</div>
</div>
<div id="outline-container-orgc64b393" class="outline-5">
<h5 id="orgc64b393">namp</h5>
</div>
</div>

<div id="outline-container-orgea945b5" class="outline-4">
<h4 id="orgea945b5">linux env bash 执行顺序</h4>
</div>
<div id="outline-container-orgb666ae8" class="outline-4">
<h4 id="orgb666ae8">socket</h4>
</div>
<div id="outline-container-orgd4887f4" class="outline-4">
<h4 id="orgd4887f4">spark/hadoop</h4>
<div class="outline-text-4" id="text-orgd4887f4">
</div>
<div id="outline-container-org199ddd3" class="outline-5">
<h5 id="org199ddd3">yarn 管理</h5>
<div class="outline-text-5" id="text-org199ddd3">
<p>
<a href="http://blog.csdn.net/suifeng3051/article/details/49486927">http://blog.csdn.net/suifeng3051/article/details/49486927</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org0ee1ec1" class="outline-4">
<h4 id="org0ee1ec1">JVM内存不要超过32G</h4>
</div>
<div id="outline-container-orgf5ac01b" class="outline-4">
<h4 id="orgf5ac01b">系统诊断</h4>
<div class="outline-text-4" id="text-orgf5ac01b">
<p>
<a href="https://www.ibm.com/developerworks/cn/java/j-lo-performance-tuning-practice/index.html">https://www.ibm.com/developerworks/cn/java/j-lo-performance-tuning-practice/index.html</a>
oS 的诊断主要关注的是 CPU、Memory、I/O 三个方面。
</p>
<ul class="org-ul">
<li>cpu 诊断
top  1，5，15分钟  不超过0.7*core</li>
<li><p>
Memory
</p>

<p>
free -m
</p>

<p>
通过 top 命令可以查看进程使用的虚拟内存 VIRT 和物理内存 RES
根据公式 VIRT = SWAP + RES 
可以推算出具体应用使用的交换分区（Swap）情况，使用交换分区过大会影响 Java 应用性能，
可以将 swappiness 值调到尽可能小。
因为对于 Java 应用来说，占用太多交换分区可能会影响性能，毕竟磁盘性能比内存慢太多
</p></li>
<li>io</li>
</ul>
</div>
</div>

<div id="outline-container-orgf4aea66" class="outline-4">
<h4 id="orgf4aea66">https 和 http区别</h4>
<div class="outline-text-4" id="text-orgf4aea66">
<p>
https 443 tls加密 加密传输身份认证的网络协议
</p>

<p>
http  80  明文  无状态连接
</p>
</div>
</div>
<div id="outline-container-org8d04a13" class="outline-4">
<h4 id="org8d04a13">nginx autoindex 403</h4>
<div class="outline-text-4" id="text-org8d04a13">
<p>
cat /var/log/nginx/error.log
</p>
<pre class="example">

2018/03/10 17:56:19 [error] 23420#0: *1 "/home/manue1/wiki/index.html" is forbidden (13: Permission denied), client: 103.1.153.220, server: www.manue1.site, request: "GET / HTTP/1.1", host: "118.24.19.57"
</pre>

<p>
目录权限问题 ps axu | grep nginx 发现启动进程用户为nginx
</p>
<pre class="example">
[manue1@manpc ~]$ ps aux | grep nginx
root     24694  0.0  0.1  58808  1188 ?        Ss   18:17   0:00 nginx: master process /usr/sbin/nginx
nginx    24695  0.0  0.2  61348  2108 ?        S    18:17   0:00 nginx: worker process
nginx    24696  0.0  0.2  61348  2108 ?        S    18:17   0:00 nginx: worker process
nginx    24697  0.0  0.2  61348  2108 ?        S    18:17   0:00 nginx: worker process
nginx    24698  0.0  0.2  61348  2596 ?        S    18:17   0:00 nginx: worker process

</pre>

<p>
查看wiki 目录权限
sudo -u nginx stat wiki
</p>
<pre class="example">

[manue1@manpc ~]$ sudo -u nginx stat wiki
[sudo] password for manue1:
stat: 无法获取"wiki" 的文件状态(stat): 权限不够

manue1@manpc ~]$ ls -al wiki/
总用量 32
drwxrwxr-x 7 manue1 manue1 4096 3月  10 16:52 .
drwx------ 4 manue1 manue1 4096 3月  10 18:14 ..
drwxrwxr-x 8 manue1 manue1 4096 3月  10 16:52 .git
drwxrwxr-x 2 manue1 manue1 4096 3月  10 16:52 html
drwxrwxr-x 2 manue1 manue1 4096 3月  10 16:52 markdown
drwxrwxr-x 2 manue1 manue1 4096 3月  10 16:52 org-mode
-rw-rwxr-- 1 manue1 manue1   15 3月  10 16:52 README.md
drwxrwxr-x 2 manue1 manue1 4096 3月  10 16:52 tools

</pre>

<p>
问题在于root 运行的nginx 启动的woker进程是nginx用户下执行的,wiki是manue1用户下的站点,直接修改nginx.conf
</p>
<pre class="example">
user manue1;
worker_processes 4;
</pre>

<p>
fixed!
</p>
</div>
</div>
<div id="outline-container-org7e2890e" class="outline-4">
<h4 id="org7e2890e">nginx 多端口绑定子域名</h4>
</div>
</div>
</div>
<div id="outline-container-org6874746" class="outline-2">
<h2 id="org6874746">java Q&amp;A</h2>
<div class="outline-text-2" id="text-org6874746">
</div>
<div id="outline-container-org4f37242" class="outline-3">
<h3 id="org4f37242">基础知识：</h3>
<div class="outline-text-3" id="text-org4f37242">
</div>
<div id="outline-container-orgfffd44e" class="outline-4">
<h4 id="orgfffd44e">集合类：List和Set比较，各自的子类比较（ArrayList，Vector，LinkedList；HashSet，TreeSet）</h4>
<div class="outline-text-4" id="text-orgfffd44e">
</div>
<div id="outline-container-orge7f4539" class="outline-5">
<h5 id="orge7f4539">arraylist with linkedlist compare</h5>
<div class="outline-text-5" id="text-orge7f4539">
<ol class="org-ol">
<li>arraylist是实现了基于动态数据的数据结构，因为地址连续，一旦数据存储好了，查询操作效率会比较高(在内存里是连着放的)</li>
<li>因为地址连续，arraylist要移动数据，所以插入和删除操作效率比较低</li>
<li>LinkedList基于链表的数据结构，地址是任意的，所以在开辟内存空间的时候不需要等一个连续地址，对于新增和删除操作，Linedlist比较占优势</li>
<li>因为Linkedlist要移动指针，所以查询操作性能比较低</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd26b2af" class="outline-4">
<h4 id="orgd26b2af">bak</h4>
<div class="outline-text-4" id="text-orgd26b2af">
<p>
2）HashMap的底层实现，之后会问ConcurrentHashMap的底层实现；
</p>

<p>
3）如何实现HashMap顺序存储：可以参考LinkedHashMap的底层实现；
</p>

<p>
4）HashTable和ConcurrentHashMap的区别；
</p>

<p>
5）String,StringBuffer和StringBuilder的区别；
</p>

<p>
6）Object的方法有哪些：比如有wait方法，为什么会有；
</p>

<p>
7）wait和sleep的区别，必须理解；
</p>

<p>
8）JVM的内存结构，JVM的算法；
</p>

<p>
9）强引用，软引用和弱引用的区别；
</p>

<p>
10）数组在内存中如何分配；
</p>

<p>
11）用过哪些设计模式，手写一个（除单例）；
</p>

<p>
12）springmvc的核心是什么，请求的流程是怎么处理的，控制反转怎么实现的；
</p>

<p>
13）spring里面的aop的原理是什么；
</p>

<p>
14）mybatis如何处理结果集：反射，建议看看源码；
</p>

<p>
15）java的多态表现在哪里；
</p>

<p>
16）接口有什么用；
</p>

<p>
17）说说http,https协议；
</p>

<p>
18）tcp/ip协议簇；
</p>

<p>
19）osi五层网络协议；
</p>

<p>
20）tcp，udp区别；
</p>

<p>
21）用过哪些加密算法：对称加密，非对称加密算法；
</p>

<p>
22）说说tcp三次握手，四次挥手；
</p>

<p>
23）cookie和session的区别，分布式环境怎么保存用户状态；
</p>

<p>
24）git，svn区别；
</p>

<p>
25）请写一段栈溢出、堆溢出的代码；
</p>

<p>
26）ThreadLocal可以用来共享数据吗；
</p>
</div>
</div>
</div>



<div id="outline-container-org5685bee" class="outline-3">
<h3 id="org5685bee">IO:</h3>
<div class="outline-text-3" id="text-org5685bee">
<p>
1）bio，nio，aio的区别；
</p>

<p>
2）nio框架：dubbo的实现原理；
</p>

<p>
3）京东内部的jsf是使用的什么协议通讯：可参见dubbo的协议；
</p>
</div>
</div>




<div id="outline-container-org5af43f3" class="outline-3">
<h3 id="org5af43f3">算法：</h3>
<div class="outline-text-3" id="text-org5af43f3">
<p>
1）java中常说的堆和栈，分别是什么数据结构；另外，为什么要分为堆和栈来存储数据。
</p>

<p>
2）TreeMap如何插入数据：二叉树的左旋，右旋，双旋；
</p>

<p>
3）一个排序之后的数组，插入数据，可以使用什么方法？答：二分法；问：时间复杂度是多少？
</p>

<p>
4）平衡二叉树的时间复杂度；
</p>

<p>
5）Hash算法和二叉树算法分别什么时候用；
</p>

<p>
6）图的广度优先算法和深度优先算法：详见jvm中垃圾回收实现；
</p>
</div>
</div>




<div id="outline-container-orga72f4f0" class="outline-3">
<h3 id="orga72f4f0">多线程相关：</h3>
<div class="outline-text-3" id="text-orga72f4f0">
<p>
1）说说阻塞队列的实现：可以参考ArrayBlockingQueue的底层实现（锁和同步都行）；
</p>

<p>
2）进程通讯的方式：消息队列，共享内存，信号量，socket通讯等；
</p>

<p>
3）用过并发包的哪些类；
</p>

<p>
4）什么地方用了多线程；
</p>

<p>
5）Excutors可以产生哪些线程池；
</p>

<p>
6）为什么要用线程池；
</p>

<p>
7）volatile关键字的用法：使多线程中的变量可见；
</p>
</div>
</div>



<div id="outline-container-org1d417a7" class="outline-3">
<h3 id="org1d417a7">数据库相关（mysql）：</h3>
<div class="outline-text-3" id="text-org1d417a7">
<p>
1）msyql优化经验：
</p>

<p>
2）mysql的语句优化，使用什么工具；
</p>

<p>
3）mysql的索引分类：B+，hash；什么情况用什么索引；
</p>

<p>
4）mysql的存储引擎有哪些，区别是什么；
</p>

<p>
5）说说事务的特性和隔离级别；
</p>

<p>
6）悲观锁和乐观锁的区别，怎么实现；
</p>
</div>
</div>





<div id="outline-container-orgf346a19" class="outline-3">
<h3 id="orgf346a19">mq：</h3>
<div class="outline-text-3" id="text-orgf346a19">
<p>
1）mq的原理是什么：有点大。。都可以说；
</p>

<p>
2）mq如何保证实时性；
</p>

<p>
3）mq的持久化是怎么做的；
</p>
</div>
</div>



<div id="outline-container-org93fe54e" class="outline-3">
<h3 id="org93fe54e">nosql相关（主要是redis）:</h3>
<div class="outline-text-3" id="text-org93fe54e">
<p>
1）redis和memcache的区别；
</p>

<p>
2）用redis做过什么；
</p>

<p>
3）redis是如何持久化的：rdb和aof；
</p>

<p>
4）redis集群如何同步；
</p>

<p>
5）redis的数据添加过程是怎样的：哈希槽；
</p>

<p>
6）redis的淘汰策略有哪些；
</p>

<p>
7）redis有哪些数据结构；
</p>
</div>
</div>



<div id="outline-container-org2961e7d" class="outline-3">
<h3 id="org2961e7d">zookeeper:</h3>
<div class="outline-text-3" id="text-org2961e7d">
<p>
1）zookeeper是什么；
</p>

<p>
2）zookeeper哪里用到；
</p>

<p>
3）zookeeper的选主过程；
</p>

<p>
4）zookeeper集群之间如何通讯；
</p>

<p>
5）你们的zookeeper的节点加密是用的什么方式；
</p>

<p>
6）分布式锁的实现过程；
</p>
</div>
</div>





<div id="outline-container-org0e17832" class="outline-3">
<h3 id="org0e17832">linux相关：</h3>
<div class="outline-text-3" id="text-org0e17832">
<p>
1）linux常用的命令有哪些；
</p>

<p>
2）如何获取java进程的pid；
</p>

<p>
3）如何获取某个进程的网络端口号；
</p>

<p>
4）如何实时打印日志；
</p>

<p>
5）如何统计某个字符串行数；
</p>
</div>
</div>





<div id="outline-container-orgebe94dc" class="outline-3">
<h3 id="orgebe94dc">设计与思想：</h3>
<div class="outline-text-3" id="text-orgebe94dc">
<p>
1）重构过代码没有？说说经验；
</p>

<p>
2）一千万的用户实时排名如何实现；
</p>

<p>
3）五万人并发抢票怎么实现
&gt;&gt;&gt;&gt;&gt;&gt;&gt; 573b673d5d1624162e3f528dddf944da93a9149f
</p>
</div>
</div>
</div>
</div>
</body>
</html>